; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v7 ?v12)
             (pred_3 ?v3 ?v9)
             (pred_11 ?v7 ?v9)
             (pred_2 ?v1 ?v7 )
	     (pred_6 ?v7)
             (pred_9 ?v2)
             (pred_8 ?v3)
             (pred_1 ?v9)
             (pred_5 ?v7)
             (pred_12 ?v3)
             (pred_4 ?v7)
             (pred_7 ))



(:action op_1
:parameters (?v13 ?v10 ?v4 ?v6)
:precondition (and (pred_9 ?v13) (pred_9 ?v10) (pred_8 ?v4) (pred_1 ?v6)
          (pred_10 ?v13 ?v10) (pred_3 ?v4 ?v6)
                   (pred_11 ?v10 ?v6) (pred_6 ?v13) 
                   (pred_5 ?v10) (pred_12 ?v4))
:effect (and  (pred_4 ?v10) (not (pred_5 ?v10))))


(:action op_5
:parameters (?v13 ?v8)
:precondition (and (pred_9 ?v13) (pred_9 ?v8)
               (pred_6 ?v13) (pred_10 ?v13 ?v8) (pred_4 ?v8))
:effect (and (pred_6 ?v8) (not (pred_6 ?v13))))

(:action op_4
:parameters (?v13 ?v4)
:precondition (and (pred_9 ?v13) (pred_8 ?v4) 
                  (pred_6 ?v13) (pred_2 ?v4 ?v13) (pred_7 ))
:effect (and (pred_12 ?v4)
   (not (pred_2 ?v4 ?v13)) (not (pred_7 ))))


(:action op_2
:parameters (?v13 ?v11 ?v5)
:precondition (and (pred_9 ?v13) (pred_8 ?v11) (pred_8 ?v5)
                  (pred_6 ?v13) (pred_12 ?v5) (pred_2 ?v11 ?v13))
:effect (and (pred_12 ?v11) (pred_2 ?v5 ?v13)
        (not (pred_12 ?v5)) (not (pred_2 ?v11 ?v13))))

(:action op_3
:parameters (?v13 ?v4)
:precondition (and (pred_9 ?v13) (pred_8 ?v4) 
                  (pred_6 ?v13) (pred_12 ?v4))
:effect (and (pred_7 ) (pred_2 ?v4 ?v13) (not (pred_12 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_12 obj_09 obj_08 obj_14 obj_07 obj_20 obj_02 obj_03 obj_17 obj_10 obj_01 obj_06 obj_15 obj_13 obj_19
    obj_11 obj_18
    obj_04 obj_16
    )

    (:init
       (pred_7)

       (pred_9 obj_05)
       (pred_9 obj_12)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_14)
       (pred_9 obj_07)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_01)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_13)
       (pred_9 obj_19)
       (pred_1 obj_11)
       (pred_1 obj_18)
       (pred_8 obj_04)
       (pred_8 obj_16)

       (pred_10 obj_05 obj_14)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_12 obj_07)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_14 obj_03)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_14 obj_05)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_12)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_20 obj_10)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_20)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_03 obj_17)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_17 obj_10)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_17 obj_03)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_20)
       (pred_10 obj_10 obj_17)
       (pred_10 obj_01 obj_19)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_06 obj_15)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_15 obj_06)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_19 obj_01)
       (pred_10 obj_19 obj_13)
       (pred_5 obj_08)
       (pred_5 obj_14)
       (pred_11  obj_08 obj_11)
       (pred_11  obj_14 obj_18)
       (pred_4 obj_05)
       (pred_4 obj_12)
       (pred_4 obj_09)
       (pred_4 obj_07)
       (pred_4 obj_20)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_4 obj_17)
       (pred_4 obj_10)
       (pred_4 obj_01)
       (pred_4 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_13)
       (pred_4 obj_19)

       (pred_3  obj_04 obj_11)
       (pred_3  obj_16 obj_18)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_16 obj_05)
       (pred_6 obj_19)
    )

    (:goal (and
       (pred_2 obj_04 obj_15)
       (pred_2 obj_16 obj_07)
    ))
(:constraints
  (always (not (pred_6 obj_17)))
)
)

; plan
1. (op_5 obj_19 obj_13)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_13)
   goals met: 0 of 2
2. (op_5 obj_13 obj_10)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_10)
   goals met: 0 of 2
3. (op_4 obj_10 obj_04)
   deleted: (pred_2 obj_04 obj_10) (pred_7)
   added: (pred_12 obj_04)
   goals met: 0 of 2
4. (op_5 obj_10 obj_20)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_20)
   goals met: 0 of 2
5. (op_5 obj_20 obj_07)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_07)
   goals met: 0 of 2
6. (op_5 obj_07 obj_12)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_12)
   goals met: 0 of 2
7. (op_5 obj_12 obj_05)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_05)
   goals met: 0 of 2
8. (op_2 obj_05 obj_16 obj_04)
   deleted: (pred_12 obj_04) (pred_2 obj_16 obj_05)
   added: (pred_12 obj_16) (pred_2 obj_04 obj_05)
   goals met: 0 of 2
9. (op_5 obj_05 obj_12)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_12)
   goals met: 0 of 2
10. (op_5 obj_12 obj_07)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_07)
   goals met: 0 of 2
11. (op_3 obj_07 obj_16)
   deleted: (pred_12 obj_16)
   added: (pred_7) (pred_2 obj_16 obj_07)
   goals met: 1 of 2
12. (op_5 obj_07 obj_12)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_12)
   goals met: 1 of 2
13. (op_5 obj_12 obj_05)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_05)
   goals met: 1 of 2
14. (op_4 obj_05 obj_04)
   deleted: (pred_2 obj_04 obj_05) (pred_7)
   added: (pred_12 obj_04)
   goals met: 1 of 2
15. (op_5 obj_05 obj_12)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_12)
   goals met: 1 of 2
16. (op_5 obj_12 obj_07)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_07)
   goals met: 1 of 2
17. (op_5 obj_07 obj_20)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_20)
   goals met: 1 of 2
18. (op_5 obj_20 obj_10)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_10)
   goals met: 1 of 2
19. (op_5 obj_10 obj_13)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_13)
   goals met: 1 of 2
20. (op_5 obj_13 obj_15)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_15)
   goals met: 1 of 2
21. (op_3 obj_15 obj_04)
   deleted: (pred_12 obj_04)
   added: (pred_7) (pred_2 obj_04 obj_15)
   goals met: 2 of 2
